"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
# код вводити тут
student_age = 20      # Вік студента
student_name = "Alexa"  # Ім'я студента
is_studing = True     # Чи навчаеться зараз


"""
**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
# код вводити тут
name_2 = "John"
user_age = 25
price_usd = 100
subject = "Math"

"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.


"""
# код вводити тут

max_number_of_students_in_group = 30

"""
**4.** Створіть змінні для збереження: 

назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
# код вводити тут
course_name = "Python"
number_of_hours = 48
course_coast = 12000

"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.

"""
# код вводити тут
course_coasts = number_of_hours / course_coast


"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
# код вводити тут
decimal = 42
binary = 101010
hexadecimal = 0x2A
octal = 52


"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
# код вводити тут


a = 17 + 5  #addition
b = 17 - 5  #subtraction
c = 17 * 5  #multiplication
d = 17 / 5  #division 
e = 17 // 5 #integer division
f = 17 % 5  #remainder
g = 17**5   #raising to a power



"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.

"""
# код вводити тут

r = 7.5
pi = 3.14159
s = pi * (r**2)
print(s)

"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.

"""
# код вводити тут

y1 = 50
y2 = 33
y3 = 14
x1 = y1 % 7
x2 = y2 % 7
x3 = y3 % 7

print (x1)
print (x2)
print (x3)


"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
# код вводити тут

s1 = 436402    #Площа Чорного моря
s2 = 37800     #площа Азовського моря
s = s1 + s2     #площу займають Чорне та Азовське моря разом


"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
# код вводити тут

name = "Olena"
first_char = name[0]           # Перший символ
last_char = name[-1]           # Останній символ
text_length = len(name)          # Довжина рядка
print(first_char)
print(last_char)
print(text_length)


"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
# код вводити тут

text = "Would you tell me, please, which way I ought to go from here?" 
first_6_symb = text[0:5]
last_11_symb = text [-11:-1]
print(first_6_symb)
print(last_11_symb)


"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""

# код вводити тут

message = """Використання
потрійних лапок
для створення
багаторядкового тексту"""
print (message)


"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
# код вводити тут
first_line = "Hello"
second_line = "World"
print (first_line, " ", second_line)
print (f'{first_line}, {second_line}')
print (first_line)
print (second_line)


"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
# код вводити тут
print ('I\'m learning Python')

"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
# код вводити тут

user_name = input("Enter your name")
user_age = input("Enter your age")
print(f'Hello, {user_name}! You are {user_age} years old')


"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
# код вводити тут

a = 232 #Кількість фото
b = 8 #Кількість фото на сторінці
c = 232 / 8 #Знадовиться сторінок
print ("Ігорю знадобиться", int(c), "сторінок")



"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
# код вводити тут
favorite_color = input ("Enter your favorite color")
favorite_number = input ("Enter your favorite number")
print (f"Prediction for you: if you meet the {favorite_color} color {favorite_number} time(s) today, the year will be successful!")


"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""

# код вводити тут
#d = 375291 всього розміщено 375291 товар a + b + c
#a + b = 250449 На першому та другому 
#b + c = 222950 На другому та третьому
b = 250449 + 222950 - 375291 
a = 250449 - b
c = 222950 - b

print (f'{a} товарів на першому складі')
print (f'{b} товарів на другому складі')
print (f'{c} товарів на третьому складі')

"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""

# код вводити тут
price = 1179 * 18
print (f'Всього за вісімнадцять місяців потрібно буде сплатити {price} грн')
